#!/bin/bash

# re='^[+-]?[0-9]+([.][0-9]+)?$'
# if [ -z $1 ]
#     then
#     echo "Ошибка. Введено 0 аргументов"
# elif [ -n "$2" ]
#     then
#     echo "Ошибка. Введено больше одного аргумента"
# elif  [[ $1 =~ $re ]]
#     then
#     echo "Ошибка. Введено число"
# else
#     echo "Введен текстовый параметр: $1"
# fi

read re < ../data/reg.txt
if [ $# -ne 1 ]
    then
    echo "Ошибка. Введите 1 аргумент"
elif  [[ $1 =~ $re ]]
    then
    echo "Ошибка. Введено число"
else
    echo "Введен текстовый параметр: $1"
fi
